Pandas
- Pandas is a library on top of Numpy which allows Python to read in data sets from various formats, such as CSV files.
- We will mainly use pandas to read in data sets and select rows or columns of data, or quickly grab statistics, such as the mean value of column.

In [17]:
import pandas as pd

In [18]:
df = pd.read_csv('salaries.csv')
df

     Name  Salary  Age Company
0   Natty   55000   39     ABC
1   Nueng  100000   44     ACC
2    Mark  250000   28     DNA
3  BamBam  200000   23    ABES

In [19]:
df[['Name', 'Salary']] # list of list of column names which we would like to see

     Name  Salary
0   Natty   55000
1   Nueng  100000
2    Mark  250000
3  BamBam  200000

In [20]:
df['Salary']

0     55000
1    100000
2    250000
3    200000
Name: Salary, dtype: int64

In [21]:
df['Salary'].mean()

151250.0

In [22]:
df['Age'] > 35 # where is the data from each column greater than 35?

0     True
1     True
2    False
3    False
Name: Age, dtype: bool

In [23]:
df[df['Age'] > 35] # get row data that age > 35

    Name  Salary  Age Company
0  Natty   55000   39     ABC
1  Nueng  100000   44     ACC

In [24]:
df['Age'].unique() # get number of the unique values

array([39, 44, 28, 23])

In [25]:
df['Age'].unique()

array([39, 44, 28, 23])

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Salary   4 non-null      int64
 2   Age      4 non-null      int64
 3   Company  4 non-null      object
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [27]:
df.describe() # to see statistical summary of our data frame

              Salary        Age
count       4.000000   4.000000
mean   151250.000000  33.500000
std     89477.650841   9.678154
min     55000.000000  23.000000
25%     88750.000000  26.750000
50%    150000.000000  33.500000
75%    212500.000000  40.250000
max    250000.000000  44.000000

In [28]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [29]:
df.head()

     Name  Salary  Age Company
0   Natty   55000   39     ABC
1   Nueng  100000   44     ACC
2    Mark  250000   28     DNA
3  BamBam  200000   23    ABES

In [30]:
df.head(2)

    Name  Salary  Age Company
0  Natty   55000   39     ABC
1  Nueng  100000   44     ACC

In [31]:
df.tail(2)

     Name  Salary  Age Company
2    Mark  250000   28     DNA
3  BamBam  200000   23    ABES